// .rak-sectors-item-img:hover{
//     background-color:#2c4e37;
//     cursor: pointer;
// }

$("document").ready(function () {
  $(".rak-sectors-item").hover(function () {
    $(".rak-sectors-item-img")
      .css("background", "#2c4e37")
      .css("cursor", "pointer");
    $(".rak-sectors-item-heading")
      .css("color", "#2c4e37")
      .css("cursor", "pointer");
  });
  ///////==========Magazine_Ver///////////////////////
  var totalNumberOfPages = 4;
  for (var i = 2; i <= totalNumberOfPages; i++) {
    if (document.getElementById("S" + i)) {
      document.getElementById("S" + i).style.display = "none";
    }
  }
});
jQuery(document).ready(function ($) {
  ////Events_Calender_Single////////
  $(".imgs").click(function () {
    //var idimg = $(this).attr('id');
    var srcimg = $(this).attr("src");
    //alert('ID is: '+ idimg+ '\n SRC: '+ srcimg);
    $(".img2").attr("src", srcimg);
  });
  ////News_Single_Post////////
  $("#news-single-div .event-details-btn>.list-group-item .side-div .imgs").on(
    "click",
    function (e) {
      $(".event-details-btn>.list-group-item .side-div .imgs").removeClass(
        "active"
      );
      $(this).addClass("active");
      $(this).css("opacity", "1");
      $("#news-single-div .event-details-btn>.list-group-item .side-div .imgs")
        .not(this)
        .css("opacity", "0.5");
      e.preventDefault();
    }
  );
  $(
    "#news-single-div .event-details-btn>.list-group-item .side-div .imgs.active"
  ).css("opacity", "1");

  $("#news-single-div .imgs").click(function () {
    var idimg = $(this).attr("id");
    var srcimg = $(this).attr("src");
    //alert('ID is: '+ idimg+ '\n SRC: '+ srcimg);
    $(".img2").attr("src", srcimg);
    if (idimg == "news1") {
      $("#news_content_div").html(
        '<p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس  الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية  والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة الشركاءالاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يومالثلاثاء</p>'
      );
    }
    if (idimg == "news2") {
      $("#news_content_div").html(
        '<p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس  الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية  والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة الشركاءالاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يومالثلاثاء</p>'
      );
      $("#news_content_div").append(
        '</br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس  الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية  والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة الشركاءالاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يومالثلاثاء</p>'
      );
    }
    if (idimg == "news3") {
      $("#news_content_div").html(
        '<p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس  الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية  والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة الشركاءالاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يومالثلاثاء</p>'
      );
      $("#news_content_div").append(
        '</br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس  الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية  والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة الشركاءالاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يومالثلاثاء</p>'
      );
      $("#news_content_div").append(
        '</br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس  الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية  والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة الشركاءالاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يومالثلاثاء</p>'
      );
    }
    if (idimg == "news4") {
      $("#news_content_div").html(
        '<p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس  الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية  والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة الشركاءالاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يومالثلاثاء</p>'
      );
    }
  });
  //////=====================////////////

  // $(".event-details-btn>.list-group-item").on("click", function (e) {
  //   $(".event-details-btn>.list-group-item").removeClass("active");
  //   $(this).addClass("active");
  //   e.preventDefault();
  // });
  $(".nav-menu").superfish({
    animation: {
      opacity: "show",
    },
    speed: 400,
  });

  if ($("#nav-menu-container").length) {
    var $mobile_nav = $("#nav-menu-container").clone().prop({
      id: "mobile-nav",
    });
    $mobile_nav.find("> ul").attr({
      class: "",
      id: "",
    });
    // $('body').append($mobile_nav);
    // $('body').prepend('<button type="button" id="mobile-nav-toggle"><i class="fa fa-bars"></i></button>');
    // $('body').append('<div id="mobile-body-overly"></div>');
    // $('#mobile-nav').find('.menu-has-children').prepend('<i class="fa fa-chevron-down"></i>');

    $(document).on("click", ".menu-has-children i", function (e) {
      $(this).next().toggleClass("menu-item-active");
      $(this).nextAll("ul").eq(0).slideToggle();
      $(this).toggleClass("fa-chevron-up fa-chevron-down");
    });
    $(".menu-has-children a").on("click", function (e) {
      $(this).toggleClass("menu-item-active");
      $(this).nextAll("ul").eq(0).slideToggle();
      $(this).toggleClass("fa-chevron-up fa-chevron-down");
    });

    $(document).on("click", "#mobile-nav-toggle", function (e) {
      $("body").toggleClass("mobile-nav-active");
      $("#mobile-nav-toggle i").toggleClass("fa-times fa-bars");
      $("#mobile-body-overly").toggle();
    });

    $(document).click(function (e) {
      var container = $("#mobile-nav, #mobile-nav-toggle");
      if (!container.is(e.target) && container.has(e.target).length === 0) {
        if ($("body").hasClass("mobile-nav-active")) {
          $("body").removeClass("mobile-nav-active");
          $("#mobile-nav-toggle i").toggleClass("fa-times fa-bars");
          $("#mobile-body-overly").fadeOut();
        }
      }
    });
  } else if ($("#mobile-nav, #mobile-nav-toggle").length) {
    $("#mobile-nav, #mobile-nav-toggle").hide();
  }
  /////Calender_Events===========//////'.event-details-btn>.list-group-item'
  $(".calender-events-div .carousel-control-next").mouseup(function (e) {
    setTimeout(function () {
      var val = $(".carousel-item.active span").html();
      $(".calender-events-div .card-body h5").html(val);
    }, 1000);
  });
  $(".calender-events-div .carousel-control-prev").mouseup(function (e) {
    setTimeout(function () {
      var val = $(".carousel-item.active span").html();
      $(".calender-events-div .card-body h5").html(val);
    }, 1000);
  });
});
function aboutCurrDiv(id) {
  //
  if (id == "1") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">نبذة عن البلدية</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "2") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">المجلس البلدي</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "3") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">كلمة المدير العام</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "4") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الرؤية والرسالة</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "5") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">القيم والاهداف</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "6") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الهلال التخصصي</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "7") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الخطة الاستراتيجية</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "8") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">سياسة الجودة</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "9") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">سياسة الطاقة</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "10") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">سياسة استمرارية العمل</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "11") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">ميثاق خدمة المتعاملين</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  }
  return false;
}

function EnvironmentDiv(id) {
  //

  if (id == "1") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">نبذة عن البلدية</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "2") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">المجلس البلدي</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "3") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">كلمة المدير العام</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "4") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الرؤية والرسالة</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "5") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">القيم والاهداف</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "6") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الهيكل التنظيمي</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "7") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الخطة الاستراتيجية</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "8") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">سياسة الجودة</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "9") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">سياسة الطاقة</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "10") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">سياسة استمرارية العمل</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "11") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">ميثاق خدمة المتعاملين</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  }
  else if (id == "12") {
    $("#current_div").html(
      `<h5 class="headcurrentlnk" id="curr_head">كلمة المدير العام</h5>
      <div class="about-border-header-curr"></div>
     <div class="row col-12 gm-speech-div">
         <div class="col-lg-4 col-md-6 col-sm-12 gm-speech-first">
          <img src="img/GmSpeech.png" alt="">
          <p class="head-name">منذر محمد بن شكر الزعابي</p>
          <div class="MunQuility-border-list-title"></div>
          <p class="MunQuility_listTitle">مدير عام دائرة بلدية رأس الخيمة</p>
         </div>
         <div class="col-lg-8 col-md-6 col-sm-12 gm-speech-second">
          <p style="text-align: right;" id="curr_p1">
              دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة
                              بلدية رأس
                              الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر
                              والمؤسسات الحكومية
                              والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة
                              الشركاء
                              الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم
                              الثلاثاء
          </p>
      <br>
  <br>
          <p style="text-align: right;">
              دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة
                                      بلدية رأس
                                      الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر
                                      والمؤسسات الحكومية
                                      والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة
                                      الشركاء
                                      الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم
                                      الثلاثاء
          </p>
      <br>
  <br>
          <p style="text-align: right;">
              دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة
                                      بلدية رأس
                                      الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر
                                      والمؤسسات الحكومية
                                      والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة
                                      الشركاء
                                      الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم
                                      الثلاثاء
          </p>
      <br>
  <br>
          <p style="text-align: right;">
              دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة
                                      بلدية رأس
                                      الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر
                                      والمؤسسات الحكومية
                                      والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة
                                      الشركاء
                                      الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم
                                      الثلاثاء
          </p>
      </div>
     </div>`
    );
  }
  if (window.innerWidth <= 767) {
    var element = document.querySelector("#current_div");
    element.scrollIntoView({ behavior: 'smooth', block: 'end'});
  }
    return false;
}

function RasAlkhimaDiv(id) {
  //

  if (id == "1") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">نبذة عن الامارة</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "2") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الأماكن السياحية</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "3") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الأماكن التراثية</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  }
}
function UsageDiv(id) {
  //

  if (id == "1") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">الموقع الرسمي</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "2") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">سبل الاستخدام</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "3") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">سياسة الخصوصية</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "4") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">حقوق النسخ</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  } else if (id == "5") {
    $("#current_div").html(
      '<h5 class="headcurrentlnk" id="curr_head">اخلاء المسئولية</h5><div class="about-border-header-curr"></div><p style="text-align:right;" id="curr_p1"> دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرةبلدية رأسالخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p></br></br><p style="text-align: right;">دائرة بلدية رأس الخيمة تكرم الشركاء الاستراتيجيين من منطلق حرص دائرة بلدية رأس الخيمة على تطوير علاقات الشراكة الاستراتيجية بشكل فعال مع الدوائر والمؤسسات الحكومية والخاصة، كرّم سعادة منذر محمد بن شكر الزعابي مدير عام بلدية رأس الخيمة  الشركاء  الاستراتيجيين والموردين والمتعاونين الحكومية والخاصة في فندق المرجان يوم  الثلاثاء</p>'
    );
  }
}
///////Magazine_Ver///////////
function showPages(id) {
  $(".pagination a").removeClass("active");
  $(".page" + id).addClass("active");
  var totalNumberOfPages = 4;
  for (var i = 1; i <= totalNumberOfPages; i++) {
    if (document.getElementById("S" + i)) {
      document.getElementById("S" + i).style.display = "none";
    }
  }

  if (document.getElementById("S" + id)) {
    document.getElementById("S" + id).style.display = "block";
    //e.preventDefault();
  }
}
function MunVisionButtonClick(button_type, e) {
  if (e != null) {
    $(".MunVision_content .MunVision_buttons a").removeClass("visionActive");

    $(e).addClass("visionActive");
    $(".MunVision_body div").removeClass("MunVision_activeContent");
    $("." + button_type).addClass("MunVision_activeContent");
    // document.getElementById(button_type).style["display"] = "block";
  }
}
function setActiveMunValue(button_type, e) {
  if (e != null) {
    // $(".MunValue_list .MunQuility_list_item a").removeClass('MunValue_active');

    // $(e).addClass("MunValue_active");
    $(".MunValue_list .MunQuility_listItemBody").removeClass(
      "MunValue_ActiveContent"
    );
    $("." + button_type).addClass("MunValue_ActiveContent");
    // document.getElementById(button_type).style["display"] = "block";
  }
}
function setActiveRasAlkhimahTourist(button_type, item_number, e) {
  if (e != null) {
    $(".RasAlkhimahTourist_list .MunQuility_list_item").removeClass(
      "RasAlkhimahTourist_active"
    );

    $("." + item_number).addClass("RasAlkhimahTourist_active");
    $(".RasAlkhimahTourist_list .MunQuility_listItemBody").removeClass(
      "MunValue_ActiveContent"
    );
    $("." + button_type).addClass("MunValue_ActiveContent");
    // document.getElementById(button_type).style["display"] = "block";
  }
}
function changeVideo(url) {
  document.getElementById("main_video").src = url;
}
function ScrollToLatestNew(){
  if (window.innerWidth <= 767) {
    var element = document.querySelector("#current_div");
    element.scrollIntoView({ behavior: 'smooth', block: 'start'});
  }
}